rails/app/controllers/api/v1/posts_controller.rb

INSERT INTO "posts" ("user_id", "created_at", "updated_at", "post_image") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["created_at", "2018-07-23 18:25:22.793442"], ["updated_at", "2018-07-23 18:25:22.793442"], ["post_image", "771ac607-d3f0-40fc-abdf-916d2dd56e2c.jpeg"]]
---
    def create
        @post = @user.posts.build(post_params)
        @post.post_image = "data:image/#{params[:type]};base64, #{params[:post_image]}"
        if @post.save!

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def index
        @posts = Post.all
        arr = []
        users = []
        @posts.each do |i|
            arr.push(i.user_id)
        end
        arr.each do |i|
            @user = User.find(i)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        def load_user
            @user = User.find(params[:user_id])