rails/app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at", "password_digest", "picture") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "e"], ["created_at", "2018-07-18 06:04:21.924288"], ["updated_at", "2018-07-18 06:04:21.924288"], ["password_digest", "1"], ["picture", "8e70fe98-c57b-41bd-8df9-45d0a1419a9d.jpeg"]]
---
    def create
      @user = User.new(user_params)
      @user.picture = "data:image/#{params[:type]};base64, #{params[:picture]}"
      if @user.save!

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 AND "users"."password_digest" = $2 LIMIT $3  [["username", "edugz"], ["password_digest", "1"], ["LIMIT", 1]]
---
    def set_user
      @user = User.find_by(username: params[:username], password_digest: params[:password])